import axios from "axios";

export const getAllBooks = () => {
  const res = [
    {
      id: 1,
      name: "Ақылды етікші",
      text: "Бұрынғы өткен заманда бір патша болған екен. Оның әрбір тәртібін халқы еш тоқтаусыз уақытымен орындап тұрады екен. Бір күні бұл патша: 'Менің әрқашан халық пайдасына еткен әмірім орнына нақпа-нақ келіп тұрады және халқым да мені жақсы көреді. Сондықтан да мен олардың пайдасын ойлаймын. Енді мен осы халқыма зиянды бір әмір таратайын. Халқым тыңдап, орнына келтірер ме екен? Жоқ, келтірмес пе екен?' – деп ойлап, уәзірлеріне:\n\n– Халыққа тегіс хабарландырыңдар. Ешкім басына пайда қылмасын! – деп, әмір қылады.\n\n– Бұдан соң уәзірлер бұл әмірді халыққа естіртіп болып, патшаға:\n\n– Халқыңыз әміріңізді нақпа-нақ айтқаныңыздай орнына келтіретін болды, – дейді.\n\n– Патша уәзірлеріне еш жауап айтпайды. Түн болған соң үстіне бөтен, ескі киім киіп, әмірінің қалай орындалғанын көру үшін көшеде жүрсе, шеттегі бір үйде шам жанып тұр екен. Патша қайыр сұраған кісі болып, шам жанып тұрған үйге келсе, үйдің ішінде бір етікші етік тігіп отыр екен. Етікші қайыршыны көріп тұра келіп, бір кішкене нан береді. Сонда қайыршы:\n\n– Сен патшаның әмірін тұтпаған не қылған адамсың? «Ешкім басына пайда қылмасын және шам да жақпасын дегені қайда?» – дейді.\n\n\nСонда етікші:\n\n– Сенің онда не жұмысың бар? Сондай әмір қылып отырған патша да ақымақ, себебі, мен жарлы адаммын, күнде төрт теңге пайда қыламын да, төрт теңге зиян қыламын. Міне, мен сонымен күн көріп отырмын. Патша ақылды болса, осыны білер еді, – дейді.\n\n\nПатша бұған жауап қайтармастан үйіне келеді де, ақылды төрт уәзірін шақырып алып:\n\n\n– Мен патшаның сұраған сауалын тапсам, сіздер маған не берер едіңіздер? – дейді.\n\n\nУәзірлер төрт мың ділдә бермекші болады. Етікші уәзірлерден төрт мың ділдәні санап алып, олармен патшаға барады да:\n\n\n– Тақсыр, мен етік тігіп, әр күні төрт сом пайда қылам, төрт сом зиян да қылам. Ол былай: бір сомды қарызға беремін, бір сомды ескі қарызыма берем, бір сомды құдыққа тастаймын, бір сомды әйелім мен екеуімізге жұмсаймыз, – депті.\n\n\n\nСонда патша: «Бұл етікші ақылды адам екен», – деп, өзіне уәзір қылған екен.\n\n",
      photo: "https://thumb.cloud.mail.ru/weblink/thumb/xw1/yQe1/cxN3UPzHS",
      audio: "https://akniettt.github.io/web/index1.html",
    },
    {
      id: 2,
      name: "Бақаның көшуі",
      text: '\r\n    Екі қаз және бір бақа бір көл жағасын мекендеп, ұзақ уақыт көрші отырыпты. Олар бір семья адамдарындай өте тату-тәтті өткен екен. Кейінгі кездерде, қатты қуаңшылық болып көл тартылып, суы кеуіп қалыпты. Қаздар суы бар жерге ұшып кетейік десе, бақаны тастап кетуге қимайды екен.\r\n\r\n- Енді қайтеміз? - деп қаздар мен бақа бас қосып, кеңес құрыпты.\r\n\r\n- Бір таяқ табайық, екеуіңдері оның екі ұшынан тістеңдер, мен ортасынан тістейін, сөйтіп суы бар жерге кетейік, - депті  ары-бері айналған бақа.\r\n\r\n  Қаздар бұған мақұл болады әрі дереу іске кіріседі. Сөйтіп, бұлар аспан кеңістігіне шарықтай көтеріледі.\r\n\r\n  Алғаш бірнеше киіз үйдің төбесінен өткенде, бұларды кейбіреулердің көзі шалады.\r\n\r\n  Олар:\r\n\r\n- Қаздар бақаны алып ұшып барады, әдісқойларын-ай, - деп дабырласады. "Менің тапқырлығым екенін білмеді-ау", - деп ойлайды бақа.\r\n\r\nҰша-ұша бұлар тағы да көп киіз үйдің төбесінен өтеді, қалың адамдар сыртқа шығып бұларды тамашалайды. Олар да:\r\n\r\n- Қаздар бақаны алып ұшып барады, әдісін тапқан - ақ екен, - деп дуылдасады. Бақа:\r\n\r\n-  "Бұл – менің тапқан әдісім", - деп айғайлап жібере жаздайды. Бұлар алға қарай ұшып отырады, сонан бағанағыдан да көп киіз үйлердің үстіне келеді, бағанағыдан да қалың адам бұларды тамашалайды.\r\n\r\n-  Қаздар бақаны алып ұшып барады, неткен әдісқой, - деп шулайды олар. Бақа шыдай алмай кетіп:\r\n\r\n-  Бұл менің ойлап тапқан әдісім! - деп айғайлап жібереді. Осы тұста таяқ аузынан шығып кетіп, бақа жерге "былш" ете түсіп мылжа-мылжасы шығады.\r\n',
      photo:
        "https://reallib.org/loader/img.php?dir=1777383ea72112195697e32542d9a107&file=3.png",
      audio: "https://akniettt.github.io/web/index2.html",
    },
    {
      id: 3,
      name: "Қарлығаш пен шөже торғай",
      text: "\r\nБір мәуелі бақта биік кәрі қарағай өсіп тұрыпты. Көктемде оның басына қарлығаш пен шөже торғай ұя салып, балапан шығарыпты.\r\n\r\nШөже торғай балапанына қурай басын сындыртпай, ерке тотай қылып өсіріпті. Балапан тентек, ойынды ғана біледі екен. Қарны ашса, шешесіне келіп, аузын ашады, анасы тапқан-таянғанын балапанына береді.\r\n\r\nАл қарлығаштың балапаны елгезек, еңбекқор болып өсіпті.\r\n\r\nУақыт зымырап өте береді. Күз түседі. Екі балапан да ержетеді. Енді олар өз беттерімен күн көріске кіріседі. Қанаты қатайған соң, қарлығаштың балапаны жол қиыншылығынан қорықпай, жылы жаққа ұшып кетеді.\r\n\r\nШөже торғайдың балапаны жерден теріп жейтін дәнге сеніп, бақта қалады. Қыс түседі. Жерді қар басады. Не азығы, не бас сұғар панасы жоқ шөже торғай әбден ашығады. Ақыры үскірік аяз соғып, ештеңеге ебі жоқ, тоғышар балапанды бүрістіріп тастайды.\r\n\r\nҚайтадан көктем келеді. Қайта оралған қарлығаштың балапаны шырылдап, құрдасын іздей бастайды.\r\n\r\n— Жылама, \r\n— дейді оған кәрі қарағай.\r\n — Шөже торғайдың балапаны еңбек етпеді. Сөйтіп, аштан өлді. Еңбексіз тіршілік жоқ. Соны біліп қой\r\n",
      photo:
        "https://cdn.culture.ru/images/8a3d0e96-08f7-53d8-b304-98cc0c720303",
      audio: "https://akniettt.github.io/web/index3.html",
    },
    {
      id: 4,
      name: "Үш дос немесе аққу, шаян, шортан",
      text: "Ніл дариясындағы пәлен мың жасаған бір жайын Сүлеймен пайғамбардың ат  басындай гауһарын жұтқан екен. Сол жайынға бір кездерде ажал уақыты жетіпті. Ол өте есті жайын екен, мендегі гауһар кісі ақысы еді, соны ақыретке арқаламай беріп кетуім керек. Ол үшін қайранға шығып өлейін. Бір кездерде жемтік арасындағы гауһарды  бір адам көріп алар. Адам алса мен борышымнан құтылғаным ғой деп ұйғарады. Сонымен жайын жағадағы қайранға шығып қаза табады. Бірнеше жыл ішінде оның жемтігін алдымен құс жеп тауысады. Жеуге келмейтін тек қана гауһар тас қалады. Бұл гауһардың жартысы су ішінде, жартысы бетінде көрініп жатыр. Су ішіндегі  жарымын шортан мен шаян көреді. Су бетіндегі жартысын мойны ұзын аққу көреді. Бұлардың әрқайсысы да оны өздері алмақ болып қызығады.\r\n\r\nШортан ойлайды: «Шіркін-ай, бұл тереңірек жерде болса  су астында шам жанғандай жарық болар еді де, көзім бұдан да жақсы көрер еді. Соның арқасында тамағым тіпті тоқ болар едім», – дейді.\r\n\r\nШаян өзінше пайдасын малданады. Ол: «Осы гауһар судан шығып тұрмай, жер астына қарай түссе, жер ішінде де сәуле болар еді. Менің балшық арасындағы балаларыма үлкен пайдасы тиер еді. Өзім де ұядан адаспай, тап басып отырар едім», – деп арман қылады.\r\n\r\nАққудың ойы бұлардан басқаша:\r\n\r\n– Гауһар менің арқамда не мойнымда болса, сұлулығым бұдан да артар еді. Көл бетінің, көк жүзінің күні мен болар едім. Шынында бұл гауһар маған ғана лайық, маған ғана жарасады, – деп сеніп, гауһарды алайын деп келсе, шортан мен шаян да келіп, өзді-өзі алмақ болып керілдесіп жатыр екен. Аққу оларға:\r\n\r\n– Сендер босқа арам тер болмаңдар, гауһарды мен аламын, ол маған ғана лайық, – дейді.\r\n\r\nОлар оған көнбейді. Үшеуі жақ болып жаңжалдасады. Ақырында олар:\r\n\r\n– Осы қазына үшеумізге де жетеді. Бірлесіп бөліп алайық, пайдасы бәрімізге ортақ болсын, – деген тұжырымға келеді. Сонымен үш дос бірлесіп алатын болып, гауһарға жегіліп тартады.\r\n\r\nӘ деп тартқанда аққу көкке қарай, шортан су түбіне қарай, шаян балшық арасына қарай үш тарап болып, үш жаққа тартады. Бірақ гауһар орнынан қозғалмайды. Осы ретпен, осы үшеуі көп уақыт үлкен машақат көреді. Не істесе де жүкті қозғай алмайды. Ақыр соңында олар ала алмай қояды. Себебін өздері де білмейді.\r\n\r\n«Бірліксіз іс – бос, жұмсалған күш» болып қала береді.",
      photo:
        "https://subliminalkey.com/wp-content/uploads/2024/01/lebed-shchuka-i-rak.-basni-1.webp",
      audio: "https://akniettt.github.io/web/index4.html",
    },
    {
      id: 5,
      name: "Құмырсқаның қанағаты",
      text: "Ертеде бір данышпан кісі болыпты. Ол кісі жан-жануарлардың, құрт-құмырсқаның тілін біледі екен.\r\n\r\nБір күні әлгі данышпан жолаушылап келе жатыпты. Жарты жолға келгенде ат шалдырып, дем алып отырса, кішкентай бір құмырсқаның дән тасып жүргенін көреді. Оны жерден көтеріп алады да, алақанына салып тұрып:\r\n\r\n– Қане, құмырсқа, айтшы, дәнді қайда алып барасың? – деп сұрайды.\r\n\r\n– Илеуіме апарамын, – дейді құмырсқа. Адам сұрайды:\r\n\r\n– Оны қайтесің?\r\n\r\n– Кейінге сақтаймын, – дейді құмырсқа. Адам:\r\n\r\n– Көп жинайсың ба? – деп сұрайды.\r\n\r\nҚұмырсқа өз шаруасының жайын былайша баяндайды:\r\n\r\n– Жаздай жұмыс істеп, жейтін азығымды жинаймын да, қыстыгүні қаннен қаперсіз тынығып жатамын.\r\n\r\nДанышпан құмырсқаны шыр айналдыра қарай бастады:\r\n\r\n– Басың неге үлкен?\r\n\r\n– Аз сөйлеп, көп ойлаймын.\r\n\r\n– Белің неге қылдырықтай?\r\n\r\n– Қомағай емеспін.\r\n\r\n– Жылына қанша дән жейсің?\r\n\r\n– Бір дән жеймін...\r\n\r\n– Соған қанағат етесің бе?\r\n\r\n– Одан көп жей берсем, жер бетіндегі басқа құмырсқалар аш қалмай ма? Қанағат керек қой!\r\n\r\nҚұмырсқаның ақылына, қанағатына, көрегендігіне сүйсінген данышпан оны сынап көрмек болады. Қорапқа бір дән салады да, құмырсқаны соған қоса қамайды. Сонан соң су тимейтін бір жайлы жерге орналастырады.\r\n\r\n– Бір жылдан кейін келемін. Дәнің бар жейтін, қамсыз жата бер, – дейді данышпан құмырсқаға ескертіп. Осылайша құмырсқаның азықты қалай үнемдейтінін білгісі келеді.\r\n\r\nБір жыл өткен соң данышпан әлгі құмырсқаға қайта оралады. Өзі қойып кеткен жерден қорапты тауып алады. Құмырсқаның өлі-тірісін білмек болып, қорапты ашады. Қараса, құмырсқа тірі екен. Қасына қалдырған жалғыз дәннің жартысын ғана жепті. Бұған таңданған данышпан:\r\n\r\n– Ей, құмырсқа, – депті мұның себебін білмек ниетпен. – Сен жылына бір дән жеймін деп едің ғой. Мына дәнді неге түгел жемей, жартысын қалдырғансың? Не себептен сонша үнемдедің?\r\n\r\nСонда құмырсқа былай депті:\r\n\r\n– Айтқаның дұрыс, мен жылына бір дән жеймін, ол рас. Ал сен болсаң мені қорапқа салып, қамап кеттің. Сыртқа шыға алмаймын. Егер сен мені бұл қамаудан босатуды ұмытып кетсең, тағы да бір жыл қамауда жататын едім. Бір дәнді түгел жеп қойсам, аштан өлетін едім. Соны ойлап, қанағат еттім.\r\n\r\nДанышпан құмырсқаның шыдамдылығы мен тастай берік қанағатына қайран қалыпты. Оны қамап кеткенінің қиянат болғанын, азапқа салғанын енді түсініп:\r\n\r\n– Менің істеген ісім дұрыс болмапты, кешір! – депті де, құмырсқаны қамаудан босатып жіберген екен.\r\n\r\nСодан кейін данышпан қанағаттың қасиетін адам баласы үйретіпті.",
      photo: "https://cdn2.static1-sima-land.com/items/3227462/0/700-nw.jpg",
      audio: "https://akniettt.github.io/web/index5.html",
    },
  ];
  return res;
};

export const getAllCompare = () => {
  const res = [
    {
      id: 1,
      text: "Сәлем",
      compareRu: "Привет",
    },
    {
      id: 2,
      text: "Сәлеметсіз бе",
      compareRu: "Здравствуйте",
    },
    {
      id: 3,
      text: "Қайырлы таң",
      compareRu: "Доброе утро",
    },
    {
      id: 4,
      text: "Қайырлы күн",
      compareRu: "Добрый день",
    },
    {
      id: 5,
      text: "Қайырлы кеш",
      compareRu: "Добрый вечер",
    },
    {
      id: 6,
      text: "Қалыңыз қалай?",
      compareRu: "Как ваши дела?",
    },
    {
      id: 7,
      text: "Қалың қалай?",
      compareRu: "Как дела?",
    },
    {
      id: 8,
      text: "Қош келдіңіз",
      compareRu: "Добро пожаловать",
    },
    {
      id: 9,
      text: "Сау болыңыз",
      compareRu: "Досвидания",
    },
  ];
  return shuffleArray(res);
};

export const getTest = () => {
  const res = [
    {
      id: 5,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Корова”)",
      answers: [
        {
          id: 13,
          text: "Әтеш",
          isCorrect: false,
        },
        {
          id: 14,
          text: "Бұқа",
          isCorrect: false,
        },
        {
          id: 15,
          text: "Сиыр",
          isCorrect: true,
        },
      ],
    },
    {
      id: 11,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Медведь”)",
      answers: [
        {
          id: 31,
          text: "Арыстан",
          isCorrect: false,
        },
        {
          id: 32,
          text: "Кірпі ",
          isCorrect: false,
        },
        {
          id: 33,
          text: "Аю",
          isCorrect: true,
        },
      ],
    },
    {
      id: 13,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Волк”)",
      answers: [
        {
          id: 37,
          text: "Шортан",
          isCorrect: false,
        },
        {
          id: 38,
          text: "Коян ",
          isCorrect: false,
        },
        {
          id: 39,
          text: "Қасқыр",
          isCorrect: true,
        },
      ],
    },
    {
      id: 9,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Собака”)",
      answers: [
        {
          id: 25,
          text: "Кошка",
          isCorrect: false,
        },
        {
          id: 26,
          text: "Ит",
          isCorrect: true,
        },
        {
          id: 27,
          text: "Лев",
          isCorrect: false,
        },
      ],
    },
    {
      id: 20,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Тауық”)",
      answers: [
        {
          id: 58,
          text: "Медведь",
          isCorrect: false,
        },
        {
          id: 59,
          text: "Курица",
          isCorrect: true,
        },
        {
          id: 60,
          text: "Лягушка",
          isCorrect: false,
        },
      ],
    },
    {
      id: 19,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Бақа”)",
      answers: [
        {
          id: 55,
          text: "Кошка",
          isCorrect: false,
        },
        {
          id: 56,
          text: "Лев",
          isCorrect: false,
        },
        {
          id: 57,
          text: "Лягушка",
          isCorrect: true,
        },
      ],
    },
    {
      id: 10,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Мысық”)",
      answers: [
        {
          id: 28,
          text: "Кошка",
          isCorrect: true,
        },
        {
          id: 29,
          text: "Лиса",
          isCorrect: false,
        },
        {
          id: 30,
          text: "Волк",
          isCorrect: false,
        },
      ],
    },
    {
      id: 6,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Шошқа”)",
      answers: [
        {
          id: 16,
          text: "Свинья",
          isCorrect: true,
        },
        {
          id: 17,
          text: "Баран",
          isCorrect: false,
        },
        {
          id: 18,
          text: "Собака",
          isCorrect: false,
        },
      ],
    },
    {
      id: 7,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Коза”)",
      answers: [
        {
          id: 19,
          text: "Ит",
          isCorrect: false,
        },
        {
          id: 20,
          text: "Қой",
          isCorrect: false,
        },
        {
          id: 21,
          text: "Ешкі",
          isCorrect: true,
        },
      ],
    },
    {
      id: 16,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Рак”)",
      answers: [
        {
          id: 46,
          text: "Сиыр",
          isCorrect: false,
        },
        {
          id: 47,
          text: "Ит",
          isCorrect: false,
        },
        {
          id: 48,
          text: "Шаян",
          isCorrect: true,
        },
      ],
    },
    {
      id: 4,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Түйе”)",
      answers: [
        {
          id: 10,
          text: "Верблюд",
          isCorrect: true,
        },
        {
          id: 11,
          text: "Корова",
          isCorrect: false,
        },
        {
          id: 12,
          text: "Петух",
          isCorrect: false,
        },
      ],
    },
    {
      id: 3,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Лошадь”)",
      answers: [
        {
          id: 7,
          text: "Сиыр",
          isCorrect: false,
        },
        {
          id: 8,
          text: "Жылқы",
          isCorrect: true,
        },
        {
          id: 9,
          text: "Қой",
          isCorrect: false,
        },
      ],
    },
    {
      id: 15,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Арыстан”)",
      answers: [
        {
          id: 43,
          text: "Лев",
          isCorrect: true,
        },
        {
          id: 44,
          text: "Волк",
          isCorrect: false,
        },
        {
          id: 45,
          text: "Медьведь",
          isCorrect: false,
        },
      ],
    },
    {
      id: 8,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Қой”)",
      answers: [
        {
          id: 22,
          text: "Собока",
          isCorrect: false,
        },
        {
          id: 23,
          text: "Овца",
          isCorrect: true,
        },
        {
          id: 24,
          text: "Коза",
          isCorrect: false,
        },
      ],
    },
    {
      id: 14,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Ёж”)",
      answers: [
        {
          id: 40,
          text: "Кірпі ",
          isCorrect: true,
        },
        {
          id: 41,
          text: "Шошқа ",
          isCorrect: false,
        },
        {
          id: 42,
          text: "Аю",
          isCorrect: false,
        },
      ],
    },
    {
      id: 18,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Щука”)",
      answers: [
        {
          id: 52,
          text: "Шортан",
          isCorrect: true,
        },
        {
          id: 53,
          text: "Аққу",
          isCorrect: false,
        },
        {
          id: 54,
          text: "Бақа",
          isCorrect: false,
        },
      ],
    },
    {
      id: 17,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Аққу”)",
      answers: [
        {
          id: 49,
          text: "Лиса",
          isCorrect: false,
        },
        {
          id: 50,
          text: "Лебедь",
          isCorrect: true,
        },
        {
          id: 51,
          text: "Ёж",
          isCorrect: false,
        },
      ],
    },
    {
      id: 12,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Түлкі”)",
      answers: [
        {
          id: 34,
          text: "Волк",
          isCorrect: false,
        },
        {
          id: 35,
          text: "Лиса ",
          isCorrect: true,
        },
        {
          id: 36,
          text: "Кошка",
          isCorrect: false,
        },
      ],
    },
    {
      id: 2,
      text: "Дұрыс аудармасын тап(Найди правильный перевод  слова “Әтеш”)",
      answers: [
        {
          id: 4,
          text: "Петух",
          isCorrect: true,
        },
        {
          id: 5,
          text: "Курица",
          isCorrect: false,
        },
        {
          id: 6,
          text: "Лебедь",
          isCorrect: false,
        },
      ],
    },
    {
      id: 1,
      text: "Дұрыс аудармасын тап (Найди правильный перевод  слова “Заяц”)",
      answers: [
        {
          id: 1,
          text: "Шортан",
          isCorrect: false,
        },
        {
          id: 2,
          text: "Қоян",
          isCorrect: true,
        },
        {
          id: 3,
          text: "Қасқыр",
          isCorrect: true,
        },
      ],
    },
  ];

  return shuffleArray(res);
};

export const getTestImage = () => {
  const res = [
    {
      id: 5,
      image:
        "https://avatars.mds.yandex.net/i?id=7ddcc8ecc9fe3e0dca258bcd8e832c867759e58d-10733191-images-thumbs&n=13",
      answers: [
        {
          id: 73,
          text: "Қияр",
          isCorrect: false,
        },
        {
          id: 74,
          text: "Пияз",
          isCorrect: false,
        },
        {
          id: 75,
          text: "Өрік",
          isCorrect: true,
        },
      ],
    },
    {
      id: 4,
      image:
        "https://rare-gallery.com/uploads/posts/809032-Peaches-Closeup-Two-White-background.jpg",
      answers: [
        {
          id: 70,
          text: "Қауын",
          isCorrect: false,
        },
        {
          id: 71,
          text: "Шабдалы",
          isCorrect: true,
        },
        {
          id: 72,
          text: "Банан",
          isCorrect: false,
        },
      ],
    },
    {
      id: 9,
      image:
        "https://catherineasquithgallery.com/uploads/posts/2021-03/1614570823_12-p-pomidor-na-belom-fone-15.jpg",
      answers: [
        {
          id: 85,
          text: "Қызанақ",
          isCorrect: true,
        },
        {
          id: 86,
          text: "Қарбыз",
          isCorrect: false,
        },
        {
          id: 87,
          text: "Өрік",
          isCorrect: false,
        },
      ],
    },
    {
      id: 8,
      image: "https://skolko-stoit.ru/wp-content/uploads/2021/04/3-25.jpg",
      answers: [
        {
          id: 82,
          text: "Шабдалы",
          isCorrect: false,
        },
        {
          id: 83,
          text: "Қарбыз",
          isCorrect: false,
        },
        {
          id: 84,
          text: "Қауын",
          isCorrect: true,
        },
      ],
    },
    {
      id: 7,
      image:
        "https://www.grvc.ru/uploadedFiles/eshopimages/big/2021food___berries_and_fruits_and_nuts_big_striped_green_watermelon_on_white_background_150972.jpg",
      answers: [
        {
          id: 79,
          text: "Банан",
          isCorrect: false,
        },
        {
          id: 80,
          text: "Қарбыз",
          isCorrect: true,
        },
        {
          id: 81,
          text: "Қияр",
          isCorrect: false,
        },
      ],
    },
    {
      id: 12,
      image: "https://prodmarket.kz/wp-content/uploads/bezymyannyj-1-377.jpg",
      answers: [
        {
          id: 94,
          text: "Қияр",
          isCorrect: true,
        },
        {
          id: 95,
          text: "Қызанақ",
          isCorrect: false,
        },
        {
          id: 96,
          text: "Пияз",
          isCorrect: false,
        },
      ],
    },
    {
      id: 13,
      image:
        "https://s.alicdn.com/@sc01/kf/UTB8BZ7KnmbIXKJkSaef761asXXan/Hot-Sale-High-quality-Potato-in-2019.png",
      answers: [
        {
          id: 97,
          text: "Қарбыз",
          isCorrect: false,
        },
        {
          id: 98,
          text: "Картоп",
          isCorrect: true,
        },
        {
          id: 99,
          text: "Сәбіз",
          isCorrect: false,
        },
      ],
    },
    {
      id: 10,
      image:
        "https://agro-sales.ru/images/wiki/orig/ffbf7e4d4b3e5840fdc997b1240da985.webp",
      answers: [
        {
          id: 88,
          text: "Сәбіз",
          isCorrect: false,
        },
        {
          id: 89,
          text: "Орамжапырақ",
          isCorrect: true,
        },
        {
          id: 90,
          text: "Сарымсақ",
          isCorrect: false,
        },
      ],
    },
    {
      id: 3,
      image: "https://sad24.ru/wp-content/uploads/2021/01/5ed92246f0278.jpg",
      answers: [
        {
          id: 67,
          text: "Сарымсақ",
          isCorrect: true,
        },
        {
          id: 68,
          text: "Шабдалы",
          isCorrect: false,
        },
        {
          id: 69,
          text: "Жүзім",
          isCorrect: true,
        },
      ],
    },
    {
      id: 11,
      image: "https://cdn-st3.rtr-vesti.ru/vh/pictures/hd/139/707/4.jpg",
      answers: [
        {
          id: 91,
          text: "Шабдалы",
          isCorrect: false,
        },
        {
          id: 92,
          text: "Банан",
          isCorrect: false,
        },
        {
          id: 93,
          text: "Пияз",
          isCorrect: true,
        },
      ],
    },
    {
      id: 6,
      image:
        "https://s3-us-west-2.amazonaws.com/anchor-generated-image-bank/production/podcast_uploaded_episode/60338/60338-1548841057129-64239f38d5f57.jpg",
      answers: [
        {
          id: 76,
          text: "Банан",
          isCorrect: true,
        },
        {
          id: 77,
          text: "Қызанақ",
          isCorrect: false,
        },
        {
          id: 78,
          text: "Картоп",
          isCorrect: false,
        },
      ],
    },
    {
      id: 1,
      image:
        "https://ketokotleta.ru/wp-content/uploads/6/c/2/6c27be5657cb3903c55d1b46e50af6fe.jpeg",
      answers: [
        {
          id: 61,
          text: "Алма",
          isCorrect: true,
        },
        {
          id: 62,
          text: "Алмұрт",
          isCorrect: false,
        },
        {
          id: 63,
          text: "Орамжапырақ",
          isCorrect: false,
        },
      ],
    },
    {
      id: 15,
      image:
        "https://witches-empire.com/upload/forum/9b3/yqm9o6zaq24156apo16nni4axunc61ci.jpg?width=500&height=500",
      answers: [
        {
          id: 103,
          text: "Өрік",
          isCorrect: false,
        },
        {
          id: 104,
          text: "Пияз",
          isCorrect: false,
        },
        {
          id: 105,
          text: "Сарымсақ",
          isCorrect: true,
        },
      ],
    },
    {
      id: 2,
      image:
        "https://gas-kvas.com/grafic/uploads/posts/2023-09/1695844893_gas-kvas-com-p-kartinki-grusha-3.jpg",
      answers: [
        {
          id: 64,
          text: "Алмұрт",
          isCorrect: true,
        },
        {
          id: 65,
          text: "Қарбыз",
          isCorrect: false,
        },
        {
          id: 66,
          text: "Картоп",
          isCorrect: false,
        },
      ],
    },
    {
      id: 14,
      image:
        "https://catherineasquithgallery.com/uploads/posts/2021-03/1614555509_7-p-morkov-kartinka-na-belom-fone-7.jpg",
      answers: [
        {
          id: 100,
          text: "Өрік",
          isCorrect: false,
        },
        {
          id: 101,
          text: "Алмұрт",
          isCorrect: false,
        },
        {
          id: 102,
          text: "Сәбіз",
          isCorrect: true,
        },
      ],
    },
  ];
  return shuffleArray(res);
};

function shuffleArray(array) {
  for (let i = array.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [array[i], array[j]] = [array[j], array[i]];
  }
  return array;
}
